## BUSA8001- Programming Task 1  

**Assignment Points**: 100  
**Submission**: Provide your answers in this notebook and submit it via iLearn

- Where a question requires a written answer provide your solution in Markdown in the cells under each question.
- Comment out your print statements unless you are explicitly asked to print your output. 
- 5 marks will be deducted for printed outputs that are not asked for.

### About the Assignment

- For this assignment there are two files in the `data` folder `credit_record.csv` and `application_record.csv` where bank clients are related by the `ID` column.

- In `application_record.csv` we have the following variables

| Feature Name         | Explanation     | Additional Remarks |
|--------------|-----------|-----------|
| ID | Randomly allocated client number      |         |
| AMT_INCOME   | Annual income  |  |
| NAME_INCOME_TYPE   | Income Source |  |
| NAME_EDUCATION_TYPE   | Level of Education  |  |
| CODE_GENDER   | Applicant's Gender   |  |
| FLAG_OWN_CAR | Car Ownership |  | 
| CNT_CHILDREN | Number of Children | |
| FLAG_OWN_REALTY | Real Estate Ownership | | 
| NAME_FAMILY_STATUS | Relationship Status | | 
| NAME_HOUSING_TYPE | Housing Type | | 
| DAYS_BIRTH | No. of Days | Count backwards from current day (0), -1 means yesterday
| DAYS_EMPLOYED | No. of Days | Count backwards from current day (0). If positive, it means the person is currently unemployed.
| FLAG_MOBIL | Mobile Phone Ownership | | 
| FLAG_WORK_PHONE | Work Phone Ownership | | 
| FLAG_PHONE | Landline Phone Ownership | | 
| FLAG_EMAIL | Landline Phone Ownership | | 
| OCCUPATION_TYPE | Occupation | | 
| CNT_FAM_MEMBERS | Count of Family Members | |



- In `credit_record.csv` we have the following variables


| Feature Name         | Explanation     | Additional Remarks |
|--------------|-----------|-----------|
| ID | Randomly allocated client number | |
| MONTHS_BALANCE | Number of months in the past from now when STATUS is measured | 0 = current month, -1 = last month, -2 = two months ago, etc.|
| STATUS | Number of days a payment is past due | 0: 1-29 days past due 1: 30-59 days past due 2: 60-89 days overdue 3: 90-119 days overdue 4: 120-149 days overdue 5: Overdue or bad debts, write-offs for more than 150 days C: paid off that month X: No loan for the month |

---
---

### Task 1: Reading, Summarising and Cleaning Data (Total Marks: 30)

**Question 1.** 

1. Import the `application_record.csv` and `credit_record.csv` files from `data` folder into pandas DataFrames named `df_application` and `df_credit`, respectively. (1 mark)

2. How many rows are there in `df_application` and `df_credit`, respectively? Provide your answers with print() and state them in Markdown text. (1 mark)

3. How many unique bank clients are there in `df_application` and `df_credit`? Provide your answers with print() and state them in Markdown text. (1 mark)

4. Add the records from `df_credit` to `df_application` by merging the data from the two DataFrames on the `ID` column, and output the joint data into a new DataFrame named `df`. Hint: Use `merge` function from pandas by setting `how` parameter to `inner` (4 marks) 

5. How many rows and how many unique clients are there now in `df`? (1 mark)

6. How are multiple rows for each `ID` in `df` different? Answer in Markdown text. (2 mark) 

(10 marks)

In [2]:
# ---- provide your code here -----
# This code file has to be stored at the same folder and same folder level as the datas
# Question 1.1

import pandas as pd #import pandas lib

df_application=pd.read_csv('application_record.csv') #import application record 
df_application.info()

df_credit=pd.read_csv('credit_record.csv')  #import credit record
df_credit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438445 entries, 0 to 438444
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438445 non-null  int64
 1   CODE_GENDER          438445 non-null  object
 2   FLAG_OWN_CAR         438445 non-null  object
 3   FLAG_OWN_REALTY      438445 non-null  object
 4   CNT_CHILDREN         438357 non-null  float64
 5   AMT_INCOME           438445 non-null  float64
 6   NAME_INCOME_TYPE     438445 non-null  object
 7   NAME_EDUCATION_TYPE  436429 non-null  object
 8   NAME_FAMILY_STATUS   438445 non-null  object
 9   NAME_HOUSING_TYPE    438445 non-null  object
 10  DAYS_BIRTH           438445 non-null  int64
 11  DAYS_EMPLOYED        438445 non-null  int64
 12  FLAG_MOBIL           438445 non-null  int64
 13  FLAG_WORK_PHONE      438445 non-null  int64
 14  FLAG_PHONE           438445 non-null  int64
 15  FLAG_EMAIL           438445 non-null  int64
 16  OCCUPATION_TYPE      304285 non-null  object
 17  CNT_FAM_MEMBERS      438445 non-null  int64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1047185 entries, 0 to 1047184
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   ID              1047185 non-null  int64
 1   MONTHS_BALANCE  1047185 non-null  int64
 2   STATUS          1047185 non-null  object
dtypes: int64(2), object(1)
memory usage: 24.0+ MB

In [3]:
#Question 1.2

#count column for df_application
print("Number of rows in df_application is ", len(df_application))

#count column for df_credit
print("Number of rows in df_credit is ", len(df_credit))

Number of rows in df_application is  438445
Number of rows in df_credit is  1047185

In [4]:
#Question 1.3

#count number of unique bank clients for df_application
print("Number of bank clients in df_application is ", len(df_application['ID'].unique()))
#count number of unique bank clients for df_credit
print("Number of bank clients in df_credit is ", len(df_credit['ID'].unique()))

Number of bank clients in df_application is  438398
Number of bank clients in df_credit is  45924

In [5]:
#Question 1.4

df=pd.merge(df_application,df_credit, how= 'inner')
df

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,MONTHS_BALANCE,STATUS
0,5008804,M,Y,Y,0.0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2,0,C
1,5008804,M,Y,Y,0.0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2,-1,C
2,5008804,M,Y,Y,0.0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2,-2,C
3,5008804,M,Y,Y,0.0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2,-3,C
4,5008804,M,Y,Y,0.0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2,-4,C
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
776320,5150337,M,N,Y,0.0,112500.0,Working,Secondary / secondary special,Single / not married,Rented apartment,-9188,-1193,1,0,0,0,Laborers,1,-9,0
776321,5150337,M,N,Y,0.0,112500.0,Working,Secondary / secondary special,Single / not married,Rented apartment,-9188,-1193,1,0,0,0,Laborers,1,-10,2
776322,5150337,M,N,Y,0.0,112500.0,Working,Secondary / secondary special,Single / not married,Rented apartment,-9188,-1193,1,0,0,0,Laborers,1,-11,1
776323,5150337,M,N,Y,0.0,112500.0,Working,Secondary / secondary special,Single / not married,Rented apartment,-9188,-1193,1,0,0,0,Laborers,1,-12,0
776324,5150337,M,N,Y,0.0,112500.0,Working,Secondary / secondary special,Single / not married,Rented apartment,-9188,-1193,1,0,0,0,Laborers,1,-13,0

In [6]:
#Question 1.5

print(f"df has {len(df)} rows") #count number of rows

print(f"there are {len(df['ID'].unique())} unique clients now in df")   #count number of unique clients

df has 776325 rows
there are 36396 unique clients now in df

---- provide your written answer here ----

---

**Question 2.**

1. Change the values of `STATUS` in `df` according to the following mapping: {C, X, 0} -> 0 and {0, 1, 2, 3, 4, 5} -> 1 making sure that the new values of 0 and 1 are encoded as integers. (2 marks)

2. Create a new *numpy* array called `list_of_past_due` that includes the unique ID numbers of clients whose `STATUS = 1` at any point during the last 12 months (hint: count the current month as the first month). (2 marks) 

3. Create a new DataFrame called `df_final` that contains the rows of `df` for which the `ID` is in `list_of_past_due`, keeping only one row for each `ID` (hint: keep the first duplicate row). How many rows do you have in `df_final`? Answer using both print() function and in Markdown text. (hint: find out about `isin()` function in pandas.) (2 marks)

4. Add a new column `y = 1` for all the rows in `df_final`. (1 marks)

5. Increase `df_final` to a total of 4,500 rows by adding rows from `df` with unique `ID`s which are not in `list_of_defaults`. To do this start adding the rows from the beginning of `df`. (hint: learn what `~`, i.e. tilde sign, does in pandas). (2 marks) 

6. Fill the missing values of `y` in `df_final` with zeros. Remove `STATUS` and `MONTHS_BALANCE` from `df_final`. (1 mark)

(10 marks)

In [7]:
# ---- provide your code here -----

#Question 2.1

df['STATUS'].replace(to_replace=["C","X",0],value=0, inplace=True)
df['STATUS']=df['STATUS'].astype(int)
df['STATUS'].replace(to_replace=list(range(1,6)),value=1, inplace=True)
df['STATUS']

#Question 2.2

import numpy as np
list_of_past_due = df['ID'][(df['STATUS'] == 1) & (df['DAYS_EMPLOYED'] < -365)].to_numpy()
print(list_of_past_due)

#QUestion 2.3

df_final = df[df['ID'].isin(list_of_past_due)].drop_duplicates(subset='ID', keep='first')

print(df_final.head())

#Question 2.4

df_final['y'] = 1
df_final.head()

#Question 2.5

#Question 2.6
df_final.drop(["STATUS","MONTHS_BALANCE"], axis='columns')  #remove STATUS AND MONTHS_BALANCE FROM DF_FINALS
df_final['y'].replace(to_replace=np.nan,value=0, inplace=True)

[5008804 5008805 5008825 ... 5150049 5150337 5150337]
          ID CODE_GENDER FLAG_OWN_CAR FLAG_OWN_REALTY  CNT_CHILDREN  \
0    5008804           M            Y               Y           0.0
16   5008805           M            Y               Y           0.0
281  5008825           F            Y               N           0.0
307  5008826           F            Y               N           0.0
337  5008830           F            N               Y           0.0

     AMT_INCOME NAME_INCOME_TYPE            NAME_EDUCATION_TYPE  \
0      427500.0          Working               Higher education
16     427500.0          Working               Higher education
281    130500.0          Working              Incomplete higher
307    130500.0          Working              Incomplete higher
337    157500.0          Working  Secondary / secondary special

    NAME_FAMILY_STATUS  NAME_HOUSING_TYPE  DAYS_BIRTH  DAYS_EMPLOYED  \
0       Civil marriage   Rented apartment      -12005          -4542
16      Civil marriage   Rented apartment      -12005          -4542
281            Married  House / apartment      -10669          -1103
307            Married  House / apartment      -10669          -1103
337            Married  House / apartment      -10031          -1469

     FLAG_MOBIL  FLAG_WORK_PHONE  FLAG_PHONE  FLAG_EMAIL OCCUPATION_TYPE  \
0             1                1           0           0             NaN
16            1                1           0           0             NaN
281           1                0           0           0     Accountants
307           1                0           0           0     Accountants
337           1                0           1           0        Laborers

     CNT_FAM_MEMBERS  MONTHS_BALANCE  STATUS
0                  2               0       0
16                 2               0       0
281                2               0       0
307                2              -1       0
337                2               0       0

---- provide your written answer here ----

<hr style="width:25%;margin-left:0;"> 

**Question 3**. 
1. Delete `ID` column from `df_final` and reset its index. (1 marks)
2. Assuming that `NAME_EDUCATION_TYPE` is the only ordinal variable in `df_final`, which variables are numeric and which ones are nominal? Answer this question by copying and completing the following table (6 marks)

|Variable type|Numbers of features|Features' list|
| --- | --- | --- |
|Numeric:|||
|Ordinal:|1| NAME_EDUCATION_TYPE |
|Nominal:|||

3. Using appropriate functions find and comment on the missing values in `df_final` (3 marks)   

(10 marks)

In [8]:
# ---- provide your code here ----
#3.1
df_final.drop("ID", axis='columns')

#3.3
df.isnull() #print data rows containing NULL values
print('Missing Values: \n',df.isnull().sum().sort_values()) #find number of Null values for each cloumn

Missing Values:
 ID                          0
CNT_FAM_MEMBERS             0
FLAG_EMAIL                  0
FLAG_PHONE                  0
FLAG_WORK_PHONE             0
FLAG_MOBIL                  0
DAYS_EMPLOYED               0
DAYS_BIRTH                  0
MONTHS_BALANCE              0
NAME_HOUSING_TYPE           0
NAME_INCOME_TYPE            0
AMT_INCOME                  0
FLAG_OWN_REALTY             0
FLAG_OWN_CAR                0
CODE_GENDER                 0
NAME_FAMILY_STATUS          0
STATUS                      0
CNT_CHILDREN             1525
NAME_EDUCATION_TYPE     38759
OCCUPATION_TYPE        239670
dtype: int64

3.2

|Variable type|Numbers of features|Features' list|
| --- | --- | --- |
|Numeric:|12| CNT_CHILDREN, AMT_INCOME, DAYS_BIRTH, DAYS_EMPLOYED, FLAG_MOBIL, FLAG_WORK_PHONE, FLAG_PHONE, FLAG_EMAIL,CNT_FAM_MEMBERS, MONTHS_BALANCE, STAUTUS |
|Ordinal:|1| NAME_EDUCATION_TYPE |
|Nominal:|7| CODE_GENDER, FLAG_OWN_CAR, FLAG_OWN_REALITY, NAME_INCOME_TYPE, NAME_FAMILY_STATUS, NAME_HOUSING_TYPE, OCCUPATION_TYPE|

---- provide your written answer here ----

---
---

### Task 2: Imputing missing values and dealing with categorical features (Total Marks: 30)

**Question 4.** 
1. Use an appropriate `pandas` function to impute missing values in `df_final` (15 marks)
    - Take into consideration the type of each variable and the best practices we discussed in class/lecture notes

(Total: 15 marks)

In [16]:
# ---- provide your code here -----
#4.1
#replace NULL valies using scikit libraries
df_final['CNT_CHILDREN'].fillna(df_final['CNT_CHILDREN'].mean(axis=0),inplace=True)
df_final['NAME_EDUCATION_TYPE'].fillna(df_final['NAME_EDUCATION_TYPE'].mode,inplace=True) #need encoding first
df_final['OCCUPATION_TYPE'].fillna(df_final['OCCUPATION_TYPE'].mode,inplace=True)

<hr style="width:25%;margin-left:0;"> 

**Question 5**. Convert the values in `NAME_EDUCATION_TYPE` as follows
- Lower secondary -> 1
- Secondary / secondary special -> 2
- Incomplete higher -> 3
- Higher education -> 4


(Total: 5 marks)

In [ ]:
# ---- provide your code here -----

<hr style="width:25%;margin-left:0;"> 

**Question 6**. 

Add dummy variables to `df_final` for all of the nominal features which are currently stored as string (text). 
- Make sure to delete the original variables from the dataframe
- Drop the first column from each set of created dummy variable, i.e. for each feature



(Total: 10 marks)

In [ ]:
# ---- provide your code here -

---
---

### Task 3 Preparing X and y arrays (Total Marks: 10)

**Question 7**. 

1. Create a numpy array named `y` from the `y` column of `df_final` making sure that the values of the array `y` are stored as integers (3 marks)   
2. Create a numpy array named `X`  from all the remaining features in `df_final` (2 marks)   

(Total: 5 Marks)

In [ ]:
# ---- provide your code here -----

<hr style="width:25%;margin-left:0;"> 

**Question 8**. 

1. Use an appropriate scikit-learn library we used in class to create `y_train`, `y_test`, `X_train` and `X_test` by splitting the data into 75% train and 25% test datasets (2.5 marks) 
    - Set random_state to 8 and stratify the subsamples so that train and test datasets have roughly equal proportions of the target's class labels 
2. Standardise the data using `StandardScaler` library (2.5 marks)   

(Total: 5 marks)

In [ ]:
# ---- provide your code here -----

---
---

### Task 4. Logistic Regression and Random Forest Classifiers and Accuracies (Total Marks: 30)

**Question 9**. 

1. Train a Logistic Regression Classifier on standardised data (5 marks)
    - Set `random_state` to 10 (don't change any other parameters)
    - Compute and print training and test dataset accuracies   
2. Train a Random Forest Classifier on standardised data (5 marks)
    - Set `random_state` to 10 (don't change any other parameters)
    - Compute and print training and test dataset accuracies

When printing accuracies round the values to three decimal places.      

(Total: 10 marks)

In [ ]:
# ---- provide your code here -----

**Question 10**. 

a) Comment and compare the training and test accuracies for each classifier computed in Question 9. What can we say about the extent of overfitting for each classifier? (5 marks)   
b) Comment and compare the accuracies across the two classifiers. Which classifier provides better forecasts? (5 marks)   
c) What can you say about the presence of nonlinearities in the dataset? (10 marks)   

(Total: 20 marks)

---- provide your written answer here ----

---
---